data/c_epoll_1000_3.txt
Run 1:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)
Total of 9999 requests completed
Run 2:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /echo/HELLO
Document Length:        5 bytes

Concurrency Level:      1000
Time taken for tests:   25.478 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      690000 bytes
HTML transferred:       50000 bytes
Requests per second:    392.50 [#/sec] (mean)
Time per request:       2547.795 [ms] (mean)
Time per request:       2.548 [ms] (mean, across all concurrent requests)
Transfer rate:          26.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       21  828 1458.7    130   11117
Processing:    51  486 1100.8    132   18803
Waiting:       31  484 1100.7    130   18803
Total:        101 1314 1817.7    561   19352

Percentage of the requests served within a certain time (ms)
  50%    561
  66%   1222
  75%   1534
  80%   2116
  90%   3255
  95%   4958
  98%   7219
  99%   9381
 100%  19352 (longest request)
Run 3:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)
Total of 9999 requests completed